[
  {
    "Name": "CANOPOLY",
    "Description": "Velit aute excepteur id eu nisi culpa duis cillum. Magna adipisicing nisi voluptate velit veniam ipsum ea ad et culpa adipisicing fugiat Lorem. Occaecat reprehenderit qui sint laboris dolore occaecat amet et culpa consequat nostrud cillum sunt esse. Cupidatat aliquip irure duis qui ipsum culpa quis ut est eu cillum proident ipsum exercitation. In non anim sit cupidatat. Sunt aliquip consequat irure pariatur ex exercitation in veniam qui aliquip nostrud. Labore id sit dolor aliqua.\r\n",
    "ReferenceNumber": "899344277",
    "Rating": 4.59,
    "Price": 744.54,
    "Color": "White",
    "Location": "Ontario",
    "Photos": [
      {
        "Url": "https://randomuser.me/api/portraits/women/40.jpg",
        "IsMain": true
      }
    ],
    "BikeType": "Sport",
    "Created": "2023-04-08",
    "Quantity": 9662
  },
  {
    "Name": "EMTRAC",
    "Description": "Irure est consectetur labore eu ea duis occaecat nisi voluptate in aliquip qui. Duis do magna velit laborum. Ea ea ad fugiat magna. Irure Lorem cillum id aute. Adipisicing labore ullamco amet voluptate laboris adipisicing anim enim nostrud proident aliqua ullamco ad. Nulla nisi minim est labore do consequat.\r\n",
    "ReferenceNumber": "112789210",
    "Rating": 2.4,
    "Price": 432.53,
    "Color": "Black",
    "Location": "Nova Scotia",
    "Photos": [
      {
        "Url": "https://randomuser.me/api/portraits/women/60.jpg",
        "IsMain": true
      }
    ],
    "BikeType": "General",
    "Created": "2023-02-23",
    "Quantity": 2904
  },
  {
    "Name": "NORSUP",
    "Description": "Esse nulla Lorem dolor labore elit aliquip ad voluptate sint exercitation nostrud id. Pariatur quis elit mollit id magna est amet veniam ea. Ut mollit velit nulla aliquip labore cupidatat irure. Pariatur officia mollit enim aliqua sit nulla commodo in. Magna aliquip eiusmod duis non ex aute ipsum veniam.\r\n",
    "ReferenceNumber": "856431935",
    "Rating": 3.74,
    "Price": 260.94,
    "Color": "Black",
    "Location": "Alberta",
    "Photos": [
      {
        "Url": "https://randomuser.me/api/portraits/women/64.jpg",
        "IsMain": true
      }
    ],
    "BikeType": "Kid",
    "Created": "2023-06-12",
    "Quantity": 4797
  },
  {
    "Name": "BEADZZA",
    "Description": "Amet pariatur occaecat do eu consectetur. Excepteur sunt fugiat proident incididunt. Incididunt est nulla dolor eu adipisicing elit cupidatat nostrud adipisicing.\r\n",
    "ReferenceNumber": "749709670",
    "Rating": 4.52,
    "Price": 338.51,
    "Color": "Blue",
    "Location": "Quebec",
    "Photos": [
      {
        "Url": "https://randomuser.me/api/portraits/women/83.jpg",
        "IsMain": true
      }
    ],
    "BikeType": "Mountain",
    "Created": "2023-01-05",
    "Quantity": 9296
  },
  {
    "Name": "MEDESIGN",
    "Description": "Dolore nulla aliquip ad nisi culpa irure ipsum ad consectetur et magna consectetur. Et laboris aliqua laboris cillum. Exercitation irure ullamco dolore voluptate occaecat velit consequat duis occaecat. Eiusmod fugiat nisi ea reprehenderit laborum ullamco laborum officia magna non. Officia esse tempor in enim sint fugiat.\r\n",
    "ReferenceNumber": "572082856",
    "Rating": 0.72,
    "Price": 123.08,
    "Color": "White",
    "Location": "Ontario",
    "Photos": [
      {
        "Url": "https://randomuser.me/api/portraits/women/20.jpg",
        "IsMain": true
      }
    ],
    "BikeType": "Mountain",
    "Created": "2023-04-14",
    "Quantity": 6474
  },
  {
    "Name": "ENTALITY",
    "Description": "Do ut eu enim laboris aute sit nulla ullamco qui sunt. Occaecat sint aliqua in culpa non occaecat elit laborum. Sit aliquip elit aliqua irure anim aliqua in. Qui velit veniam eu tempor quis excepteur in ut sint voluptate amet. Nisi non mollit dolore enim amet ea sint mollit magna enim veniam consectetur proident. Laborum laborum Lorem incididunt officia exercitation pariatur proident reprehenderit.\r\n",
    "ReferenceNumber": "227013346",
    "Rating": 3.12,
    "Price": 432.94,
    "Color": "Green",
    "Location": "Quebec",
    "Photos": [
      {
        "Url": "https://randomuser.me/api/portraits/women/30.jpg",
        "IsMain": true
      }
    ],
    "BikeType": "Kid",
    "Created": "2023-04-23",
    "Quantity": 3568
  },
  {
    "Name": "FIBRODYNE",
    "Description": "Consequat nulla do consectetur mollit duis labore laboris do eiusmod velit sint anim voluptate enim. Enim officia do est enim eu esse culpa. Elit anim non minim incididunt. Exercitation excepteur consequat duis culpa. Dolor ullamco ad nulla id ea aliqua est duis.\r\n",
    "ReferenceNumber": "543062986",
    "Rating": 1.41,
    "Price": 564.79,
    "Color": "Blue",
    "Location": "Quebec",
    "Photos": [
      {
        "Url": "https://randomuser.me/api/portraits/women/18.jpg",
        "IsMain": true
      }
    ],
    "BikeType": "Sport",
    "Created": "2023-01-16",
    "Quantity": 7280
  },
  {
    "Name": "MUSIX",
    "Description": "Cillum commodo ipsum ipsum labore eiusmod ex velit. Sint velit Lorem id magna enim consectetur quis tempor pariatur veniam laboris labore officia. Consequat aute eu laborum anim aliqua nisi voluptate incididunt. Non laboris id cupidatat magna laboris occaecat consectetur anim esse laborum nostrud. Sit adipisicing quis eu do reprehenderit laborum. Occaecat incididunt aliquip consectetur eu.\r\n",
    "ReferenceNumber": "790054654",
    "Rating": 3,
    "Price": 412.5,
    "Color": "Red",
    "Location": "Alberta",
    "Photos": [
      {
        "Url": "https://randomuser.me/api/portraits/women/76.jpg",
        "IsMain": true
      }
    ],
    "BikeType": "Sport",
    "Created": "2023-02-04",
    "Quantity": 1472
  },
  {
    "Name": "DECRATEX",
    "Description": "Exercitation adipisicing et irure ut aliquip in duis sint aliquip voluptate laborum. Sunt dolor non est nisi eu voluptate reprehenderit officia nulla cillum sit in minim aliqua. Do eiusmod dolor consequat veniam exercitation reprehenderit. Deserunt dolor et ullamco nostrud sint tempor duis ea. Consequat duis sint exercitation eu culpa. Laborum Lorem adipisicing nisi qui excepteur.\r\n",
    "ReferenceNumber": "450193700",
    "Rating": 0.39,
    "Price": 113.13,
    "Color": "White",
    "Location": "Ontario",
    "Photos": [
      {
        "Url": "https://randomuser.me/api/portraits/women/70.jpg",
        "IsMain": true
      }
    ],
    "BikeType": "General",
    "Created": "2023-06-12",
    "Quantity": 7817
  },
  {
    "Name": "ENDIPINE",
    "Description": "Officia adipisicing proident proident irure eu nisi dolor sit eiusmod ut deserunt nulla. Ipsum incididunt proident consequat id officia velit. Nulla ullamco pariatur sunt mollit. Adipisicing fugiat voluptate sint nostrud. Anim consectetur voluptate commodo ullamco fugiat quis elit voluptate sunt. Pariatur tempor Lorem tempor aliquip veniam sit. Officia aute nostrud ex amet.\r\n",
    "ReferenceNumber": "873527153",
    "Rating": 4.03,
    "Price": 677.79,
    "Color": "Blue",
    "Location": "Ontario",
    "Photos": [
      {
        "Url": "https://randomuser.me/api/portraits/women/93.jpg",
        "IsMain": true
      }
    ],
    "BikeType": "Kid",
    "Created": "2023-06-27",
    "Quantity": 9632
  }
]